app/controllers/visitors_controller.rb

  def index
    respond_to do |format|
      format.json { render json: Visitor.all }
---
SELECT "visitors".* FROM "visitors"

  def create
    # respond_with Visitor.create(visitor_params)
    @visitor = Visitor.new(visitor_params)
    if @visitor.save
---
INSERT INTO "visitors" ("created_at", "first_name", "last_name", "reason", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["created_at", "2016-05-27 11:00:08.713728"], ["first_name", "dfsdf"], ["last_name", "sdfsd"], ["reason", "sdf"], ["updated_at", "2016-05-27 11:00:08.713728"]]

  def destroy
    respond_with Visitor.destroy(params[:id])
---
DELETE FROM "visitors" WHERE "visitors"."id" = $1  [["id", 1]]